#+TITLE: Drake Org-Babel Demo
#+AUTHOR: Drake Contributors
#+DATE: 2026-03-16
#+OPTIONS: toc:t num:nil
#+STARTUP: showall inlineimages

** Load Data in Session

#+BEGIN_SRC drake :session analysis
(setq tips (drake-load-csv "../datasets/tips.csv.gz"))
(message "Loaded %d rows" (length (plist-get tips :total_bill)))
#+END_SRC

#+RESULTS:
: Loaded 244 rows

** Prepare Data

#+NAME: my-data
#+BEGIN_SRC emacs-lisp
'(:x [10 20 30 40 50]
  :y [15 35 25 50 45]
  :category ["A" "B" "A" "B" "A"])
#+END_SRC

#+RESULTS: my-data
| :x | [10 20 30 40 50] | :y | [15 35 25 50 45] | :category | [A B A B A] |

